{
  "cells": [
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "Zc5qVC9GjWN7"
      },
      "source": [
        "# Using GraphRAG-SDK to Create a Knowledge Graph and RAG System from Unstructured Documents\n",
        "\n",
        "GraphRAG-SDK provides a powerful tool, enhanced by LLM technology, to build a Retrieval-Augmented Generation (RAG) system. This example demonstrates how to load UFC HTML files, automatically detect ontology based on 10% of the files, and create a Knowledge Graph (KG) to enable a question-answerable RAG system."
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 25,
      "metadata": {
        "id": "k5l1fSZWjWN8",
        "outputId": "8c45207f-68eb-4e5a-9d26-557c35b9322f",
        "colab": {
          "base_uri": "https://localhost:8080/"
        }
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Requirement already satisfied: graphrag_sdk in /usr/local/lib/python3.10/dist-packages (0.2.2)\n",
            "Requirement already satisfied: backoff<3.0.0,>=2.2.1 in /usr/local/lib/python3.10/dist-packages (from graphrag_sdk) (2.2.1)\n",
            "Requirement already satisfied: bs4<0.0.3,>=0.0.2 in /usr/local/lib/python3.10/dist-packages (from graphrag_sdk) (0.0.2)\n",
            "Requirement already satisfied: falkordb<2.0.0,>=1.0.9 in /usr/local/lib/python3.10/dist-packages (from graphrag_sdk) (1.0.9)\n",
            "Requirement already satisfied: fix-busted-json<0.0.19,>=0.0.18 in /usr/local/lib/python3.10/dist-packages (from graphrag_sdk) (0.0.18)\n",
            "Requirement already satisfied: google-generativeai<0.9.0,>=0.8.1 in /usr/local/lib/python3.10/dist-packages (from graphrag_sdk) (0.8.3)\n",
            "Requirement already satisfied: ipykernel<7.0.0,>=6.29.5 in /usr/local/lib/python3.10/dist-packages (from graphrag_sdk) (6.29.5)\n",
            "Requirement already satisfied: ollama<0.3.0,>=0.2.1 in /usr/local/lib/python3.10/dist-packages (from graphrag_sdk) (0.2.1)\n",
            "Requirement already satisfied: openai<2.0.0,>=1.35.9 in /usr/local/lib/python3.10/dist-packages (from graphrag_sdk) (1.52.2)\n",
            "Requirement already satisfied: pypdf<5.0.0,>=4.2.0 in /usr/local/lib/python3.10/dist-packages (from graphrag_sdk) (4.3.1)\n",
            "Requirement already satisfied: python-abc<0.3.0,>=0.2.0 in /usr/local/lib/python3.10/dist-packages (from graphrag_sdk) (0.2.0)\n",
            "Requirement already satisfied: python-dotenv<2.0.0,>=1.0.1 in /usr/local/lib/python3.10/dist-packages (from graphrag_sdk) (1.0.1)\n",
            "Requirement already satisfied: ratelimit<3.0.0,>=2.2.1 in /usr/local/lib/python3.10/dist-packages (from graphrag_sdk) (2.2.1)\n",
            "Requirement already satisfied: typing-extensions<5.0.0,>=4.12.1 in /usr/local/lib/python3.10/dist-packages (from graphrag_sdk) (4.12.2)\n",
            "Requirement already satisfied: vertexai<2.0.0,>=1.49.0 in /usr/local/lib/python3.10/dist-packages (from graphrag_sdk) (1.71.1)\n",
            "Requirement already satisfied: beautifulsoup4 in /usr/local/lib/python3.10/dist-packages (from bs4<0.0.3,>=0.0.2->graphrag_sdk) (4.12.3)\n",
            "Requirement already satisfied: redis<6.0.0,>=5.0.1 in /usr/local/lib/python3.10/dist-packages (from falkordb<2.0.0,>=1.0.9->graphrag_sdk) (5.2.0)\n",
            "Requirement already satisfied: google-ai-generativelanguage==0.6.10 in /usr/local/lib/python3.10/dist-packages (from google-generativeai<0.9.0,>=0.8.1->graphrag_sdk) (0.6.10)\n",
            "Requirement already satisfied: google-api-core in /usr/local/lib/python3.10/dist-packages (from google-generativeai<0.9.0,>=0.8.1->graphrag_sdk) (2.19.2)\n",
            "Requirement already satisfied: google-api-python-client in /usr/local/lib/python3.10/dist-packages (from google-generativeai<0.9.0,>=0.8.1->graphrag_sdk) (2.137.0)\n",
            "Requirement already satisfied: google-auth>=2.15.0 in /usr/local/lib/python3.10/dist-packages (from google-generativeai<0.9.0,>=0.8.1->graphrag_sdk) (2.27.0)\n",
            "Requirement already satisfied: protobuf in /usr/local/lib/python3.10/dist-packages (from google-generativeai<0.9.0,>=0.8.1->graphrag_sdk) (3.20.3)\n",
            "Requirement already satisfied: pydantic in /usr/local/lib/python3.10/dist-packages (from google-generativeai<0.9.0,>=0.8.1->graphrag_sdk) (2.9.2)\n",
            "Requirement already satisfied: tqdm in /usr/local/lib/python3.10/dist-packages (from google-generativeai<0.9.0,>=0.8.1->graphrag_sdk) (4.66.6)\n",
            "Requirement already satisfied: proto-plus<2.0.0dev,>=1.22.3 in /usr/local/lib/python3.10/dist-packages (from google-ai-generativelanguage==0.6.10->google-generativeai<0.9.0,>=0.8.1->graphrag_sdk) (1.25.0)\n",
            "Requirement already satisfied: comm>=0.1.1 in /usr/local/lib/python3.10/dist-packages (from ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (0.2.2)\n",
            "Requirement already satisfied: debugpy>=1.6.5 in /usr/local/lib/python3.10/dist-packages (from ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (1.6.6)\n",
            "Requirement already satisfied: ipython>=7.23.1 in /usr/local/lib/python3.10/dist-packages (from ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (7.34.0)\n",
            "Requirement already satisfied: jupyter-client>=6.1.12 in /usr/local/lib/python3.10/dist-packages (from ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (6.1.12)\n",
            "Requirement already satisfied: jupyter-core!=5.0.*,>=4.12 in /usr/local/lib/python3.10/dist-packages (from ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (5.7.2)\n",
            "Requirement already satisfied: matplotlib-inline>=0.1 in /usr/local/lib/python3.10/dist-packages (from ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (0.1.7)\n",
            "Requirement already satisfied: nest-asyncio in /usr/local/lib/python3.10/dist-packages (from ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (1.6.0)\n",
            "Requirement already satisfied: packaging in /usr/local/lib/python3.10/dist-packages (from ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (24.1)\n",
            "Requirement already satisfied: psutil in /usr/local/lib/python3.10/dist-packages (from ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (5.9.5)\n",
            "Requirement already satisfied: pyzmq>=24 in /usr/local/lib/python3.10/dist-packages (from ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (24.0.1)\n",
            "Requirement already satisfied: tornado>=6.1 in /usr/local/lib/python3.10/dist-packages (from ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (6.3.3)\n",
            "Requirement already satisfied: traitlets>=5.4.0 in /usr/local/lib/python3.10/dist-packages (from ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (5.7.1)\n",
            "Requirement already satisfied: httpx<0.28.0,>=0.27.0 in /usr/local/lib/python3.10/dist-packages (from ollama<0.3.0,>=0.2.1->graphrag_sdk) (0.27.2)\n",
            "Requirement already satisfied: anyio<5,>=3.5.0 in /usr/local/lib/python3.10/dist-packages (from openai<2.0.0,>=1.35.9->graphrag_sdk) (3.7.1)\n",
            "Requirement already satisfied: distro<2,>=1.7.0 in /usr/local/lib/python3.10/dist-packages (from openai<2.0.0,>=1.35.9->graphrag_sdk) (1.9.0)\n",
            "Requirement already satisfied: jiter<1,>=0.4.0 in /usr/local/lib/python3.10/dist-packages (from openai<2.0.0,>=1.35.9->graphrag_sdk) (0.6.1)\n",
            "Requirement already satisfied: sniffio in /usr/local/lib/python3.10/dist-packages (from openai<2.0.0,>=1.35.9->graphrag_sdk) (1.3.1)\n",
            "Requirement already satisfied: google-cloud-aiplatform==1.71.1 in /usr/local/lib/python3.10/dist-packages (from google-cloud-aiplatform[all]==1.71.1->vertexai<2.0.0,>=1.49.0->graphrag_sdk) (1.71.1)\n",
            "Requirement already satisfied: google-cloud-storage<3.0.0dev,>=1.32.0 in /usr/local/lib/python3.10/dist-packages (from google-cloud-aiplatform==1.71.1->google-cloud-aiplatform[all]==1.71.1->vertexai<2.0.0,>=1.49.0->graphrag_sdk) (2.8.0)\n",
            "Requirement already satisfied: google-cloud-bigquery!=3.20.0,<4.0.0dev,>=1.15.0 in /usr/local/lib/python3.10/dist-packages (from google-cloud-aiplatform==1.71.1->google-cloud-aiplatform[all]==1.71.1->vertexai<2.0.0,>=1.49.0->graphrag_sdk) (3.25.0)\n",
            "Requirement already satisfied: google-cloud-resource-manager<3.0.0dev,>=1.3.3 in /usr/local/lib/python3.10/dist-packages (from google-cloud-aiplatform==1.71.1->google-cloud-aiplatform[all]==1.71.1->vertexai<2.0.0,>=1.49.0->graphrag_sdk) (1.13.0)\n",
            "Requirement already satisfied: shapely<3.0.0dev in /usr/local/lib/python3.10/dist-packages (from google-cloud-aiplatform==1.71.1->google-cloud-aiplatform[all]==1.71.1->vertexai<2.0.0,>=1.49.0->graphrag_sdk) (2.0.6)\n",
            "Requirement already satisfied: docstring-parser<1 in /usr/local/lib/python3.10/dist-packages (from google-cloud-aiplatform==1.71.1->google-cloud-aiplatform[all]==1.71.1->vertexai<2.0.0,>=1.49.0->graphrag_sdk) (0.16)\n",
            "\u001b[33mWARNING: google-cloud-aiplatform 1.71.1 does not provide the extra 'all'\u001b[0m\u001b[33m\n",
            "\u001b[0mRequirement already satisfied: idna>=2.8 in /usr/local/lib/python3.10/dist-packages (from anyio<5,>=3.5.0->openai<2.0.0,>=1.35.9->graphrag_sdk) (3.10)\n",
            "Requirement already satisfied: exceptiongroup in /usr/local/lib/python3.10/dist-packages (from anyio<5,>=3.5.0->openai<2.0.0,>=1.35.9->graphrag_sdk) (1.2.2)\n",
            "Requirement already satisfied: googleapis-common-protos<2.0.dev0,>=1.56.2 in /usr/local/lib/python3.10/dist-packages (from google-api-core->google-generativeai<0.9.0,>=0.8.1->graphrag_sdk) (1.65.0)\n",
            "Requirement already satisfied: requests<3.0.0.dev0,>=2.18.0 in /usr/local/lib/python3.10/dist-packages (from google-api-core->google-generativeai<0.9.0,>=0.8.1->graphrag_sdk) (2.32.3)\n",
            "Requirement already satisfied: cachetools<6.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from google-auth>=2.15.0->google-generativeai<0.9.0,>=0.8.1->graphrag_sdk) (5.5.0)\n",
            "Requirement already satisfied: pyasn1-modules>=0.2.1 in /usr/local/lib/python3.10/dist-packages (from google-auth>=2.15.0->google-generativeai<0.9.0,>=0.8.1->graphrag_sdk) (0.4.1)\n",
            "Requirement already satisfied: rsa<5,>=3.1.4 in /usr/local/lib/python3.10/dist-packages (from google-auth>=2.15.0->google-generativeai<0.9.0,>=0.8.1->graphrag_sdk) (4.9)\n",
            "Requirement already satisfied: certifi in /usr/local/lib/python3.10/dist-packages (from httpx<0.28.0,>=0.27.0->ollama<0.3.0,>=0.2.1->graphrag_sdk) (2024.8.30)\n",
            "Requirement already satisfied: httpcore==1.* in /usr/local/lib/python3.10/dist-packages (from httpx<0.28.0,>=0.27.0->ollama<0.3.0,>=0.2.1->graphrag_sdk) (1.0.6)\n",
            "Requirement already satisfied: h11<0.15,>=0.13 in /usr/local/lib/python3.10/dist-packages (from httpcore==1.*->httpx<0.28.0,>=0.27.0->ollama<0.3.0,>=0.2.1->graphrag_sdk) (0.14.0)\n",
            "Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.10/dist-packages (from ipython>=7.23.1->ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (75.1.0)\n",
            "Requirement already satisfied: jedi>=0.16 in /usr/local/lib/python3.10/dist-packages (from ipython>=7.23.1->ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (0.19.1)\n",
            "Requirement already satisfied: decorator in /usr/local/lib/python3.10/dist-packages (from ipython>=7.23.1->ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (4.4.2)\n",
            "Requirement already satisfied: pickleshare in /usr/local/lib/python3.10/dist-packages (from ipython>=7.23.1->ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (0.7.5)\n",
            "Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from ipython>=7.23.1->ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (3.0.48)\n",
            "Requirement already satisfied: pygments in /usr/local/lib/python3.10/dist-packages (from ipython>=7.23.1->ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (2.18.0)\n",
            "Requirement already satisfied: backcall in /usr/local/lib/python3.10/dist-packages (from ipython>=7.23.1->ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (0.2.0)\n",
            "Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.10/dist-packages (from ipython>=7.23.1->ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (4.9.0)\n",
            "Requirement already satisfied: python-dateutil>=2.1 in /usr/local/lib/python3.10/dist-packages (from jupyter-client>=6.1.12->ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (2.8.2)\n",
            "Requirement already satisfied: platformdirs>=2.5 in /usr/local/lib/python3.10/dist-packages (from jupyter-core!=5.0.*,>=4.12->ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (4.3.6)\n",
            "Requirement already satisfied: annotated-types>=0.6.0 in /usr/local/lib/python3.10/dist-packages (from pydantic->google-generativeai<0.9.0,>=0.8.1->graphrag_sdk) (0.7.0)\n",
            "Requirement already satisfied: pydantic-core==2.23.4 in /usr/local/lib/python3.10/dist-packages (from pydantic->google-generativeai<0.9.0,>=0.8.1->graphrag_sdk) (2.23.4)\n",
            "Requirement already satisfied: async-timeout>=4.0.3 in /usr/local/lib/python3.10/dist-packages (from redis<6.0.0,>=5.0.1->falkordb<2.0.0,>=1.0.9->graphrag_sdk) (4.0.3)\n",
            "Requirement already satisfied: soupsieve>1.2 in /usr/local/lib/python3.10/dist-packages (from beautifulsoup4->bs4<0.0.3,>=0.0.2->graphrag_sdk) (2.6)\n",
            "Requirement already satisfied: httplib2<1.dev0,>=0.19.0 in /usr/local/lib/python3.10/dist-packages (from google-api-python-client->google-generativeai<0.9.0,>=0.8.1->graphrag_sdk) (0.22.0)\n",
            "Requirement already satisfied: google-auth-httplib2<1.0.0,>=0.2.0 in /usr/local/lib/python3.10/dist-packages (from google-api-python-client->google-generativeai<0.9.0,>=0.8.1->graphrag_sdk) (0.2.0)\n",
            "Requirement already satisfied: uritemplate<5,>=3.0.1 in /usr/local/lib/python3.10/dist-packages (from google-api-python-client->google-generativeai<0.9.0,>=0.8.1->graphrag_sdk) (4.1.1)\n",
            "Requirement already satisfied: grpcio<2.0dev,>=1.33.2 in /usr/local/lib/python3.10/dist-packages (from google-api-core[grpc]!=2.0.*,!=2.1.*,!=2.10.*,!=2.2.*,!=2.3.*,!=2.4.*,!=2.5.*,!=2.6.*,!=2.7.*,!=2.8.*,!=2.9.*,<3.0.0dev,>=1.34.1->google-ai-generativelanguage==0.6.10->google-generativeai<0.9.0,>=0.8.1->graphrag_sdk) (1.64.1)\n",
            "Requirement already satisfied: grpcio-status<2.0.dev0,>=1.33.2 in /usr/local/lib/python3.10/dist-packages (from google-api-core[grpc]!=2.0.*,!=2.1.*,!=2.10.*,!=2.2.*,!=2.3.*,!=2.4.*,!=2.5.*,!=2.6.*,!=2.7.*,!=2.8.*,!=2.9.*,<3.0.0dev,>=1.34.1->google-ai-generativelanguage==0.6.10->google-generativeai<0.9.0,>=0.8.1->graphrag_sdk) (1.48.2)\n",
            "Requirement already satisfied: google-cloud-core<3.0.0dev,>=1.6.0 in /usr/local/lib/python3.10/dist-packages (from google-cloud-bigquery!=3.20.0,<4.0.0dev,>=1.15.0->google-cloud-aiplatform==1.71.1->google-cloud-aiplatform[all]==1.71.1->vertexai<2.0.0,>=1.49.0->graphrag_sdk) (2.4.1)\n",
            "Requirement already satisfied: google-resumable-media<3.0dev,>=0.6.0 in /usr/local/lib/python3.10/dist-packages (from google-cloud-bigquery!=3.20.0,<4.0.0dev,>=1.15.0->google-cloud-aiplatform==1.71.1->google-cloud-aiplatform[all]==1.71.1->vertexai<2.0.0,>=1.49.0->graphrag_sdk) (2.7.2)\n",
            "Requirement already satisfied: grpc-google-iam-v1<1.0.0dev,>=0.12.4 in /usr/local/lib/python3.10/dist-packages (from google-cloud-resource-manager<3.0.0dev,>=1.3.3->google-cloud-aiplatform==1.71.1->google-cloud-aiplatform[all]==1.71.1->vertexai<2.0.0,>=1.49.0->graphrag_sdk) (0.13.1)\n",
            "Requirement already satisfied: pyparsing!=3.0.0,!=3.0.1,!=3.0.2,!=3.0.3,<4,>=2.4.2 in /usr/local/lib/python3.10/dist-packages (from httplib2<1.dev0,>=0.19.0->google-api-python-client->google-generativeai<0.9.0,>=0.8.1->graphrag_sdk) (3.2.0)\n",
            "Requirement already satisfied: parso<0.9.0,>=0.8.3 in /usr/local/lib/python3.10/dist-packages (from jedi>=0.16->ipython>=7.23.1->ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (0.8.4)\n",
            "Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.10/dist-packages (from pexpect>4.3->ipython>=7.23.1->ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (0.7.0)\n",
            "Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=7.23.1->ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (0.2.13)\n",
            "Requirement already satisfied: pyasn1<0.7.0,>=0.4.6 in /usr/local/lib/python3.10/dist-packages (from pyasn1-modules>=0.2.1->google-auth>=2.15.0->google-generativeai<0.9.0,>=0.8.1->graphrag_sdk) (0.6.1)\n",
            "Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.10/dist-packages (from python-dateutil>=2.1->jupyter-client>=6.1.12->ipykernel<7.0.0,>=6.29.5->graphrag_sdk) (1.16.0)\n",
            "Requirement already satisfied: charset-normalizer<4,>=2 in /usr/local/lib/python3.10/dist-packages (from requests<3.0.0.dev0,>=2.18.0->google-api-core->google-generativeai<0.9.0,>=0.8.1->graphrag_sdk) (3.4.0)\n",
            "Requirement already satisfied: urllib3<3,>=1.21.1 in /usr/local/lib/python3.10/dist-packages (from requests<3.0.0.dev0,>=2.18.0->google-api-core->google-generativeai<0.9.0,>=0.8.1->graphrag_sdk) (2.2.3)\n",
            "Requirement already satisfied: numpy<3,>=1.14 in /usr/local/lib/python3.10/dist-packages (from shapely<3.0.0dev->google-cloud-aiplatform==1.71.1->google-cloud-aiplatform[all]==1.71.1->vertexai<2.0.0,>=1.49.0->graphrag_sdk) (1.26.4)\n",
            "Requirement already satisfied: google-crc32c<2.0dev,>=1.0 in /usr/local/lib/python3.10/dist-packages (from google-resumable-media<3.0dev,>=0.6.0->google-cloud-bigquery!=3.20.0,<4.0.0dev,>=1.15.0->google-cloud-aiplatform==1.71.1->google-cloud-aiplatform[all]==1.71.1->vertexai<2.0.0,>=1.49.0->graphrag_sdk) (1.6.0)\n"
          ]
        }
      ],
      "source": [
        "!pip install graphrag_sdk"
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "!sudo apt-get update\n",
        "!sudo apt-get install redis-server"
      ],
      "metadata": {
        "id": "xJYO9GbAk_bM",
        "outputId": "90c58681-1994-47dd-a5e0-b6e8fea82aef",
        "colab": {
          "base_uri": "https://localhost:8080/"
        }
      },
      "execution_count": 16,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "\r0% [Working]\r            \rHit:1 http://archive.ubuntu.com/ubuntu jammy InRelease\n",
            "\r0% [Waiting for headers] [Waiting for headers] [Connected to cloud.r-project.or\r                                                                               \rGet:2 http://archive.ubuntu.com/ubuntu jammy-updates InRelease [128 kB]\n",
            "\r0% [2 InRelease 47.5 kB/128 kB 37%] [Waiting for headers] [Waiting for headers]\r                                                                               \rGet:3 https://cloud.r-project.org/bin/linux/ubuntu jammy-cran40/ InRelease [3,626 B]\n",
            "\r0% [2 InRelease 79.3 kB/128 kB 62%] [Waiting for headers] [3 InRelease 3,626 B/\r0% [2 InRelease 79.3 kB/128 kB 62%] [Waiting for headers] [Connected to r2u.sta\r0% [Waiting for headers] [Waiting for headers] [Waiting for headers] [Waiting f\r                                                                               \rGet:4 http://archive.ubuntu.com/ubuntu jammy-backports InRelease [127 kB]\n",
            "\r0% [4 InRelease 5,484 B/127 kB 4%] [Waiting for headers] [Waiting for headers] \r0% [Waiting for headers] [Waiting for headers] [Waiting for headers] [Connected\r                                                                               \rGet:5 https://developer.download.nvidia.com/compute/cuda/repos/ubuntu2204/x86_64  InRelease [1,581 B]\n",
            "\r0% [Waiting for headers] [Waiting for headers] [Connected to ppa.launchpadconte\r                                                                               \rGet:6 http://security.ubuntu.com/ubuntu jammy-security InRelease [129 kB]\n",
            "Ign:7 https://r2u.stat.illinois.edu/ubuntu jammy InRelease\n",
            "Get:8 https://r2u.stat.illinois.edu/ubuntu jammy Release [5,713 B]\n",
            "Get:9 https://r2u.stat.illinois.edu/ubuntu jammy Release.gpg [793 B]\n",
            "Hit:10 https://ppa.launchpadcontent.net/deadsnakes/ppa/ubuntu jammy InRelease\n",
            "Hit:11 https://ppa.launchpadcontent.net/graphics-drivers/ppa/ubuntu jammy InRelease\n",
            "Hit:12 https://ppa.launchpadcontent.net/ubuntugis/ppa/ubuntu jammy InRelease\n",
            "Get:13 http://archive.ubuntu.com/ubuntu jammy-updates/main amd64 Packages [2,665 kB]\n",
            "Get:14 http://archive.ubuntu.com/ubuntu jammy-updates/restricted amd64 Packages [3,305 kB]\n",
            "Get:15 http://archive.ubuntu.com/ubuntu jammy-updates/universe amd64 Packages [1,450 kB]\n",
            "Get:16 https://developer.download.nvidia.com/compute/cuda/repos/ubuntu2204/x86_64  Packages [1,105 kB]\n",
            "Get:17 http://security.ubuntu.com/ubuntu jammy-security/restricted amd64 Packages [3,227 kB]\n",
            "Get:18 http://security.ubuntu.com/ubuntu jammy-security/universe amd64 Packages [1,162 kB]\n",
            "Get:19 http://security.ubuntu.com/ubuntu jammy-security/main amd64 Packages [2,389 kB]\n",
            "Get:20 https://r2u.stat.illinois.edu/ubuntu jammy/main amd64 Packages [2,606 kB]\n",
            "Get:21 https://r2u.stat.illinois.edu/ubuntu jammy/main all Packages [8,430 kB]\n",
            "Fetched 26.7 MB in 3s (8,444 kB/s)\n",
            "Reading package lists... Done\n",
            "W: Skipping acquire of configured file 'main/source/Sources' as repository 'https://r2u.stat.illinois.edu/ubuntu jammy InRelease' does not seem to provide it (sources.list entry misspelt?)\n",
            "Reading package lists... Done\n",
            "Building dependency tree... Done\n",
            "Reading state information... Done\n",
            "The following additional packages will be installed:\n",
            "  libjemalloc2 liblua5.1-0 liblzf1 lua-bitop lua-cjson redis-tools\n",
            "Suggested packages:\n",
            "  ruby-redis\n",
            "The following NEW packages will be installed:\n",
            "  libjemalloc2 liblua5.1-0 liblzf1 lua-bitop lua-cjson redis-server\n",
            "  redis-tools\n",
            "0 upgraded, 7 newly installed, 0 to remove and 51 not upgraded.\n",
            "Need to get 1,273 kB of archives.\n",
            "After this operation, 5,725 kB of additional disk space will be used.\n",
            "Get:1 http://archive.ubuntu.com/ubuntu jammy/universe amd64 libjemalloc2 amd64 5.2.1-4ubuntu1 [240 kB]\n",
            "Get:2 http://archive.ubuntu.com/ubuntu jammy/universe amd64 liblua5.1-0 amd64 5.1.5-8.1build4 [99.9 kB]\n",
            "Get:3 http://archive.ubuntu.com/ubuntu jammy/universe amd64 liblzf1 amd64 3.6-3 [7,444 B]\n",
            "Get:4 http://archive.ubuntu.com/ubuntu jammy/universe amd64 lua-bitop amd64 1.0.2-5 [6,680 B]\n",
            "Get:5 http://archive.ubuntu.com/ubuntu jammy/universe amd64 lua-cjson amd64 2.1.0+dfsg-2.1 [17.4 kB]\n",
            "Get:6 http://archive.ubuntu.com/ubuntu jammy/universe amd64 redis-tools amd64 5:6.0.16-1ubuntu1 [856 kB]\n",
            "Get:7 http://archive.ubuntu.com/ubuntu jammy/universe amd64 redis-server amd64 5:6.0.16-1ubuntu1 [45.9 kB]\n",
            "Fetched 1,273 kB in 0s (4,885 kB/s)\n",
            "debconf: unable to initialize frontend: Dialog\n",
            "debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78, <> line 7.)\n",
            "debconf: falling back to frontend: Readline\n",
            "debconf: unable to initialize frontend: Readline\n",
            "debconf: (This frontend requires a controlling tty.)\n",
            "debconf: falling back to frontend: Teletype\n",
            "dpkg-preconfigure: unable to re-open stdin: \n",
            "Selecting previously unselected package libjemalloc2:amd64.\n",
            "(Reading database ... 123623 files and directories currently installed.)\n",
            "Preparing to unpack .../0-libjemalloc2_5.2.1-4ubuntu1_amd64.deb ...\n",
            "Unpacking libjemalloc2:amd64 (5.2.1-4ubuntu1) ...\n",
            "Selecting previously unselected package liblua5.1-0:amd64.\n",
            "Preparing to unpack .../1-liblua5.1-0_5.1.5-8.1build4_amd64.deb ...\n",
            "Unpacking liblua5.1-0:amd64 (5.1.5-8.1build4) ...\n",
            "Selecting previously unselected package liblzf1:amd64.\n",
            "Preparing to unpack .../2-liblzf1_3.6-3_amd64.deb ...\n",
            "Unpacking liblzf1:amd64 (3.6-3) ...\n",
            "Selecting previously unselected package lua-bitop:amd64.\n",
            "Preparing to unpack .../3-lua-bitop_1.0.2-5_amd64.deb ...\n",
            "Unpacking lua-bitop:amd64 (1.0.2-5) ...\n",
            "Selecting previously unselected package lua-cjson:amd64.\n",
            "Preparing to unpack .../4-lua-cjson_2.1.0+dfsg-2.1_amd64.deb ...\n",
            "Unpacking lua-cjson:amd64 (2.1.0+dfsg-2.1) ...\n",
            "Selecting previously unselected package redis-tools.\n",
            "Preparing to unpack .../5-redis-tools_5%3a6.0.16-1ubuntu1_amd64.deb ...\n",
            "Unpacking redis-tools (5:6.0.16-1ubuntu1) ...\n",
            "Selecting previously unselected package redis-server.\n",
            "Preparing to unpack .../6-redis-server_5%3a6.0.16-1ubuntu1_amd64.deb ...\n",
            "Unpacking redis-server (5:6.0.16-1ubuntu1) ...\n",
            "Setting up libjemalloc2:amd64 (5.2.1-4ubuntu1) ...\n",
            "Setting up lua-cjson:amd64 (2.1.0+dfsg-2.1) ...\n",
            "Setting up liblzf1:amd64 (3.6-3) ...\n",
            "Setting up lua-bitop:amd64 (1.0.2-5) ...\n",
            "Setting up liblua5.1-0:amd64 (5.1.5-8.1build4) ...\n",
            "Setting up redis-tools (5:6.0.16-1ubuntu1) ...\n",
            "Setting up redis-server (5:6.0.16-1ubuntu1) ...\n",
            "invoke-rc.d: could not determine current runlevel\n",
            "invoke-rc.d: policy-rc.d denied execution of start.\n",
            "Created symlink /etc/systemd/system/redis.service → /lib/systemd/system/redis-server.service.\n",
            "Created symlink /etc/systemd/system/multi-user.target.wants/redis-server.service → /lib/systemd/system/redis-server.service.\n",
            "Processing triggers for man-db (2.10.2-1) ...\n",
            "Processing triggers for libc-bin (2.35-0ubuntu3.4) ...\n",
            "/sbin/ldconfig.real: /usr/local/lib/libumf.so.0 is not a symbolic link\n",
            "\n",
            "/sbin/ldconfig.real: /usr/local/lib/libur_adapter_opencl.so.0 is not a symbolic link\n",
            "\n",
            "/sbin/ldconfig.real: /usr/local/lib/libur_loader.so.0 is not a symbolic link\n",
            "\n",
            "/sbin/ldconfig.real: /usr/local/lib/libtbb.so.12 is not a symbolic link\n",
            "\n",
            "/sbin/ldconfig.real: /usr/local/lib/libtbbbind.so.3 is not a symbolic link\n",
            "\n",
            "/sbin/ldconfig.real: /usr/local/lib/libtcm_debug.so.1 is not a symbolic link\n",
            "\n",
            "/sbin/ldconfig.real: /usr/local/lib/libhwloc.so.15 is not a symbolic link\n",
            "\n",
            "/sbin/ldconfig.real: /usr/local/lib/libtbbbind_2_5.so.3 is not a symbolic link\n",
            "\n",
            "/sbin/ldconfig.real: /usr/local/lib/libtbbmalloc_proxy.so.2 is not a symbolic link\n",
            "\n",
            "/sbin/ldconfig.real: /usr/local/lib/libtcm.so.1 is not a symbolic link\n",
            "\n",
            "/sbin/ldconfig.real: /usr/local/lib/libtbbbind_2_0.so.3 is not a symbolic link\n",
            "\n",
            "/sbin/ldconfig.real: /usr/local/lib/libtbbmalloc.so.2 is not a symbolic link\n",
            "\n",
            "/sbin/ldconfig.real: /usr/local/lib/libur_adapter_level_zero.so.0 is not a symbolic link\n",
            "\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "!sudo /etc/init.d/redis-server start"
      ],
      "metadata": {
        "id": "k1UWeLX8lEMF",
        "outputId": "e8597b21-13f7-4942-b5ee-42fbccbcf533",
        "colab": {
          "base_uri": "https://localhost:8080/"
        }
      },
      "execution_count": 17,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Starting redis-server: redis-server.\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 6,
      "metadata": {
        "id": "6X-uByNFjWN9"
      },
      "outputs": [],
      "source": [
        "import os\n",
        "import json\n",
        "import random\n",
        "from dotenv import load_dotenv\n",
        "from graphrag_sdk.source import Source\n",
        "from graphrag_sdk import KnowledgeGraph, Ontology\n",
        "from graphrag_sdk.models.gemini import GeminiGenerativeModel\n",
        "from graphrag_sdk.model_config import KnowledgeGraphModelConfig\n",
        "\n",
        "# Load environment variables\n",
        "load_dotenv()\n",
        "\n",
        "# Configuration\n",
        "os.environ['GOOGLE_API_KEY'] = \"AIzaSyC5dotVVs2S4Mv8xpI4cttb0PAK6tIXsGA\"# OpenAI API key\n"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "Sj5VoMoKjWN9"
      },
      "source": [
        "### Import Source Data from Disk\n",
        "\n",
        "This example uses UFC HTML files as the source data. We will import these files as `Source` objects."
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 26,
      "metadata": {
        "id": "RBuTGO6EjWN-",
        "outputId": "ef398b80-b183-4893-93e6-9815523ca7f4",
        "colab": {
          "base_uri": "https://localhost:8080/"
        }
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Loaded 1 sources.\n"
          ]
        }
      ],
      "source": [
        "# Data folder.\n",
        "src_files = \"./input\"\n",
        "sources = []\n",
        "\n",
        "# For each file in the source directory, create a new Source object.\n",
        "for file in os.listdir(src_files):\n",
        "    sources.append(Source(os.path.join(src_files, file)))\n",
        "print(f\"Loaded {len(sources)} sources.\")"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "SrIPLPupjWN-"
      },
      "source": [
        "### Ontology from the Sources\n",
        "\n",
        "Next, we will utilize an LLM to automatically extract ontology from a portion of the data (10%) and save it as a JSON file for manual review. We will also add `boundaries` to the ontology detection process to ensure the desired ontology is accurately identified."
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 13,
      "metadata": {
        "id": "tEtlUCIEjWN-",
        "outputId": "18b513bd-a6c3-4d35-a1fa-4f3c0cbc297b",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 430
        }
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "ERROR:tornado.access:503 POST /v1beta/models/gemini-1.5-pro-latest:generateContent?%24alt=json%3Benum-encoding%3Dint (127.0.0.1) 6046.76ms\n",
            "DEBUG:graphrag_sdk.steps.create_ontology_step:Model response: GenerationResponse(text={\"entities\":[{\"label\":\"Loan\",\"attributes\":[{\"name\":\"loan_type\",\"type\":\"string\",\"unique\":true,\"required\":true},{\"name\":\"purpose\",\"type\":\"string\",\"unique\":false,\"required\":true},{\"name\":\"interest_rate_excellent\",\"type\":\"string\",\"unique\":false,\"required\":false},{\"name\":\"interest_rate_good\",\"type\":\"string\",\"unique\":false,\"required\":false},{\"name\":\"interest_rate_fair\",\"type\":\"string\",\"unique\":false,\"required\":false},{\"name\":\"interest_rate_poor\",\"type\":\"string\",\"unique\":false,\"required\":false},{\"name\":\"interest_rate_very_poor\",\"type\":\"string\",\"unique\":false,\"required\":false}]},{\"label\":\"Website\",\"attributes\":[{\"name\":\"name\",\"type\":\"string\",\"unique\":true,\"required\":true}]},{\"label\":\"FinancialInstitution\",\"attributes\":[{\"name\":\"name\",\"type\":\"string\",\"unique\":true,\"required\":false}]}],\"relations\":[{\"label\":\"PROVIDES\",\"source\":{\"label\":\"FinancialInstitution\"},\"target\":{\"label\":\"Loan\"},\"attributes\":[]},{\"label\":\"HAS\",\"source\":{\"label\":\"FinancialInstitution\"},\"target\":{\"label\":\"Website\"},\"attributes\":[]},{\"label\":\"CALCULATES\",\"source\":{\"label\":\"Website\"},\"target\":{\"label\":\"Loan\"},\"attributes\":[{\"name\":\"eligibility\",\"type\":\"boolean\",\"unique\":false,\"required\":true}]}]}, finish_reason=STOP)\n",
            "DEBUG:graphrag_sdk.ontology:Adding entity Loan\n",
            "DEBUG:graphrag_sdk.ontology:Adding entity Website\n",
            "DEBUG:graphrag_sdk.ontology:Adding entity FinancialInstitution\n",
            "DEBUG:graphrag_sdk.ontology:Adding relation PROVIDES\n",
            "DEBUG:graphrag_sdk.ontology:Adding relation HAS\n",
            "DEBUG:graphrag_sdk.ontology:Adding relation CALCULATES\n",
            "DEBUG:graphrag_sdk.steps.create_ontology_step:Processed document: <graphrag_sdk.document.Document object at 0x7a7babd7c9a0>\n",
            "DEBUG:graphrag_sdk.steps.create_ontology_step:Fixing ontology...\n",
            "DEBUG:graphrag_sdk.steps.create_ontology_step:Model response: GenerationResponse(text=```json\n",
            "{\"entities\":[{\"label\":\"Loan\",\"attributes\":[{\"name\":\"loan_type\",\"type\":\"string\",\"unique\":true,\"required\":true},{\"name\":\"purpose\",\"type\":\"string\",\"unique\":false,\"required\":true},{\"name\":\"interest_rate_excellent\",\"type\":\"string\",\"unique\":false,\"required\":false},{\"name\":\"interest_rate_good\",\"type\":\"string\",\"unique\":false,\"required\":false},{\"name\":\"interest_rate_fair\",\"type\":\"string\",\"unique\":false,\"required\":false},{\"name\":\"interest_rate_poor\",\"type\":\"string\",\"unique\":false,\"required\":false},{\"name\":\"interest_rate_very_poor\",\"type\":\"string\",\"unique\":false,\"required\":false}]},{\"label\":\"Website\",\"attributes\":[{\"name\":\"name\",\"type\":\"string\",\"unique\":true,\"required\":true}]},{\"label\":\"FinancialInstitution\",\"attributes\":[{\"name\":\"name\",\"type\":\"string\",\"unique\":true,\"required\":true}]}],\"relations\":[{\"label\":\"PROVIDES\",\"source\":{\"label\":\"FinancialInstitution\"},\"target\":{\"label\":\"Loan\"},\"attributes\":[]},{\"label\":\"HAS\",\"source\":{\"label\":\"FinancialInstitution\"},\"target\":{\"label\":\"Website\"},\"attributes\":[]},{\"label\":\"CALCULATES\",\"source\":{\"label\":\"Website\"},\"target\":{\"label\":\"Loan\"},\"attributes\":[{\"name\":\"eligibility\",\"type\":\"boolean\",\"unique\":false,\"required\":true}]}]}\n",
            "```, finish_reason=STOP)\n",
            "DEBUG:graphrag_sdk.steps.create_ontology_step:Fixed ontology: Entities:\n",
            "\f- (:Loan {loan_type: \"string!*\", purpose: \"string*\", interest_rate_excellent: \"string\", interest_rate_good: \"string\", interest_rate_fair: \"string\", interest_rate_poor: \"string\", interest_rate_very_poor: \"string\"})\n",
            "- (:Website {name: \"string!*\"})\n",
            "- (:FinancialInstitution {name: \"string!\"})\n",
            "\n",
            "Edges:\n",
            "\f- (:FinancialInstitution)-[:PROVIDES {}]->(:Loan)\n",
            "- (:FinancialInstitution)-[:HAS {}]->(:Website)\n",
            "- (:Website)-[:CALCULATES {eligibility: \"boolean*\"}]->(:Loan)\n"
          ]
        }
      ],
      "source": [
        "# Define the percentage of files that will be used to auto-create the ontology.\n",
        "# Ensure at least 1 source is selected even with small percentage\n",
        "percent = 0.1  # Adjust as needed, but consider the dataset size\n",
        "\n",
        "boundaries = \"\"\"\n",
        "    Extract only the most relevant information about UFC fighters, fights, and events.\n",
        "    Avoid creating entities for details that can be expressed as attributes.\n",
        "\"\"\"\n",
        "\n",
        "# Define the model to be used for the ontology\n",
        "model = GeminiGenerativeModel(model_name=\"gemini-1.5-pro-latest\")\n",
        "\n",
        "# Randomly select a percentage of files from sources,\n",
        "# but ensure at least one source is selected\n",
        "num_samples = max(1, round(len(sources) * percent))  # Ensure at least 1 sample\n",
        "sampled_sources = random.sample(sources, num_samples)\n",
        "\n",
        "ontology = Ontology.from_sources(\n",
        "    sources=sampled_sources,\n",
        "    boundaries=boundaries,\n",
        "    model=model,\n",
        ")\n",
        "\n",
        "# Save the ontology to the disk as a json file.\n",
        "with open(\"ontology.json\", \"w\", encoding=\"utf-8\") as file:\n",
        "    file.write(json.dumps(ontology.to_json(), indent=2))"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "rF57ZSAtjWN-"
      },
      "source": [
        "Review the Ontology"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 14,
      "metadata": {
        "id": "I_PubP9OjWN-",
        "outputId": "eaeb4f70-1785-4604-80f5-a81b34a472fc",
        "colab": {
          "base_uri": "https://localhost:8080/"
        }
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "{\n",
            "    \"entities\": [\n",
            "        {\n",
            "            \"label\": \"Loan\",\n",
            "            \"attributes\": [\n",
            "                {\n",
            "                    \"name\": \"loan_type\",\n",
            "                    \"type\": \"string\",\n",
            "                    \"unique\": true,\n",
            "                    \"required\": true\n",
            "                },\n",
            "                {\n",
            "                    \"name\": \"purpose\",\n",
            "                    \"type\": \"string\",\n",
            "                    \"unique\": false,\n",
            "                    \"required\": true\n",
            "                },\n",
            "                {\n",
            "                    \"name\": \"interest_rate_excellent\",\n",
            "                    \"type\": \"string\",\n",
            "                    \"unique\": false,\n",
            "                    \"required\": false\n",
            "                },\n",
            "                {\n",
            "                    \"name\": \"interest_rate_good\",\n",
            "                    \"type\": \"string\",\n",
            "                    \"unique\": false,\n",
            "                    \"required\": false\n",
            "                },\n",
            "                {\n",
            "                    \"name\": \"interest_rate_fair\",\n",
            "                    \"type\": \"string\",\n",
            "                    \"unique\": false,\n",
            "                    \"required\": false\n",
            "                },\n",
            "                {\n",
            "                    \"name\": \"interest_rate_poor\",\n",
            "                    \"type\": \"string\",\n",
            "                    \"unique\": false,\n",
            "                    \"required\": false\n",
            "                },\n",
            "                {\n",
            "                    \"name\": \"interest_rate_very_poor\",\n",
            "                    \"type\": \"string\",\n",
            "                    \"unique\": false,\n",
            "                    \"required\": false\n",
            "                }\n",
            "            ],\n",
            "            \"description\": \"\"\n",
            "        },\n",
            "        {\n",
            "            \"label\": \"Website\",\n",
            "            \"attributes\": [\n",
            "                {\n",
            "                    \"name\": \"name\",\n",
            "                    \"type\": \"string\",\n",
            "                    \"unique\": true,\n",
            "                    \"required\": true\n",
            "                }\n",
            "            ],\n",
            "            \"description\": \"\"\n",
            "        },\n",
            "        {\n",
            "            \"label\": \"FinancialInstitution\",\n",
            "            \"attributes\": [\n",
            "                {\n",
            "                    \"name\": \"name\",\n",
            "                    \"type\": \"string\",\n",
            "                    \"unique\": true,\n",
            "                    \"required\": false\n",
            "                }\n",
            "            ],\n",
            "            \"description\": \"\"\n",
            "        }\n",
            "    ],\n",
            "    \"relations\": [\n",
            "        {\n",
            "            \"label\": \"PROVIDES\",\n",
            "            \"source\": {\n",
            "                \"label\": \"FinancialInstitution\"\n",
            "            },\n",
            "            \"target\": {\n",
            "                \"label\": \"Loan\"\n",
            "            },\n",
            "            \"attributes\": []\n",
            "        },\n",
            "        {\n",
            "            \"label\": \"HAS\",\n",
            "            \"source\": {\n",
            "                \"label\": \"FinancialInstitution\"\n",
            "            },\n",
            "            \"target\": {\n",
            "                \"label\": \"Website\"\n",
            "            },\n",
            "            \"attributes\": []\n",
            "        },\n",
            "        {\n",
            "            \"label\": \"CALCULATES\",\n",
            "            \"source\": {\n",
            "                \"label\": \"Website\"\n",
            "            },\n",
            "            \"target\": {\n",
            "                \"label\": \"Loan\"\n",
            "            },\n",
            "            \"attributes\": [\n",
            "                {\n",
            "                    \"name\": \"eligibility\",\n",
            "                    \"type\": \"boolean\",\n",
            "                    \"unique\": false,\n",
            "                    \"required\": true\n",
            "                }\n",
            "            ]\n",
            "        }\n",
            "    ]\n",
            "}\n"
          ]
        }
      ],
      "source": [
        "print(json.dumps(ontology.to_json(), indent=4))"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "0PVcKu5ZjWN-"
      },
      "source": [
        "### KG from Sources and Ontology\n",
        "\n",
        "After reviewing the ontology, we will load it and use it to create a Knowledge Graph (KG) from the sources."
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 18,
      "metadata": {
        "id": "fMaQc_anjWN_",
        "outputId": "240bc4fe-9f37-4a0a-d3b2-c534a6664f4f",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 466
        }
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "DEBUG:graphrag_sdk.steps.extract_data_step:Processing 1 documents\n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Processing task: extract_data_step_6b8b132d-1650-4a34-98d0-e43a3f117e88\n",
            "DEBUG:extract_data_step_6b8b132d-1650-4a34-98d0-e43a3f117e88:Processing task: extract_data_step_6b8b132d-1650-4a34-98d0-e43a3f117e88\n",
            "DEBUG:extract_data_step_6b8b132d-1650-4a34-98d0-e43a3f117e88:User message:  You are tasked with extracting entities and relations from the text below, using the ontology provided.  **Output Format:**  - Provide the extracted data as a JSON object with two keys: `\"entities\"` and `\"relations\"`.  - **Entities**: Represent entities and concepts. Each entity should have a `\"label\"` and `\"attributes\"` field.  - **Relations**: Represent relations between entities or concepts. Each relation should have a `\"label\"`, `\"source\"`, `\"target\"`, and `\"attributes\"` field.  **Guidelines:** - **Extract all entities and relations**: Capture all entities and relations mentioned in the text.  - **Use Only the Provided Ontology**: Utilize only the types of entities, relations, and attributes defined in the ontology.  - **Assign IDs Where Required**: Assign textual IDs to entities and relations as specified.  - **Avoid Duplicates**: Ensure each entity and relation is unique; do not include duplicates.  - **Formatting**:   - Do not include any introduction or explanation in the response, only the JSON.      - Use double quotes for all string values.    - Properly escape any special characters.    - Dates should be in the format `\"YYYY-MM-DD\"`.    - Correct any spacing or formatting issues in text fields as necessary.  - **Precision**: Be concise and precise in your extraction.  - **Token Limit**: Ensure your response does not exceed **8192 tokens**.  **User Instructions**:    **Ontology**: {'entities': [{'label': 'Loan', 'attributes': [{'name': 'loan_type', 'type': 'string', 'unique': True, 'required': True}, {'name': 'purpose', 'type': 'string', 'unique': False, 'required': True}, {'name': 'interest_rate_excellent', 'type': 'string', 'unique': False, 'required': False}, {'name': 'interest_rate_good', 'type': 'string', 'unique': False, 'required': False}, {'name': 'interest_rate_fair', 'type': 'string', 'unique': False, 'required': False}, {'name': 'interest_rate_poor', 'type': 'string', 'unique': False, 'required': False}, {'name': 'interest_rate_very_poor', 'type': 'string', 'unique': False, 'required': False}], 'description': ''}, {'label': 'Website', 'attributes': [{'name': 'name', 'type': 'string', 'unique': True, 'required': True}], 'description': ''}, {'label': 'FinancialInstitution', 'attributes': [{'name': 'name', 'type': 'string', 'unique': True, 'required': False}], 'description': ''}], 'relations': [{'label': 'PROVIDES', 'source': {'label': 'FinancialInstitution'}, 'target': {'label': 'Loan'}, 'attributes': []}, {'label': 'HAS', 'source': {'label': 'FinancialInstitution'}, 'target': {'label': 'Website'}, 'attributes': []}, {'label': 'CALCULATES', 'source': {'label': 'Website'}, 'target': {'label': 'Loan'}, 'attributes': [{'name': 'eligibility', 'type': 'boolean', 'unique': False, 'required': True}]}]}  **Raw Text**: Common Questions for Personal Loans Answered  Ques : How do I check if I am eligible to apply for a personal loan? Ans : Most lenders specify the eligibility criteria that you will need to meet for your loan application to be approved on their respective websites. You can also use the personal loan eligibility calculator tool, which you will find on the websites of banks and financial institutions and on third-party financial services websites like BankBazaar.com.  Ques : What is the maximum sum of money that I can borrow from a bank? Ans : The maximum sum of money that you will be able to borrow from a bank will vary based on a number of factors. If you are a salaried employee, your monthly EMI should ideally not exceed 30% of your monthly pay. Also, the bank/NBFC will take into account if you have any existing loans for which you pay EMIs. Individuals who are self-employed will be offered a loan amount as per the profits that are earned through their business. The concerned individual's other financial liabilities will also be taken into account. The maximum loan amount offered will also depend on the lender's own terms and conditions.  Ques : Are there any advantages in applying for a personal loan online? Ans : Yes, applying for a personal loan online saves you a considerable amount of time and effort, given that you can do it from the comfort of your house. Certain third-party financial services websites like BankBazaar.com also offer paperless approval, wherein you will not be required to submit any paperwork to the lender for your loan to be approved. The application process is also completely secure.  Ques : What is the repayment tenure for personal loans? Ans : Most banks/financial institutions allow borrowers to choose a loan tenure between 1 year and 5 years, based on their convenience.  Ques : What documents will I have to submit when applying for a personal loan? Ans : While the exact documents required vary from lender to lender, listed below are a few general documents that most banks/financial institutions usually require applicants to submit: * Proof of identity * Address proof * Proof of income * Proof of business (applicable only for self-employed individuals) * Any other documents requested by the lender  Ques : What are the things that I should look for before applying for a personal loan? Ans : A few things that you should consider when applying for a personal loan are as follows: * Interest Rates: The interest rate charged for a personal loan can go from as low as 10% p.a. to as high as 24% p.a., based on the lender's terms and conditions and your credit score. The interest rate makes a substantial difference to the cumulative cost of the loan. * Repayment Flexibility: Make sure to check if the lender allows part-payments or pre-payments and if there is any penalty levied for making the payment. * Processing Fee: Even if you are offered a low interest rate, a high processing fee could bump up the cost of your loan. * Customer Service: Ensure that the lender has sufficient customer care channels for you to reach them on. Your loan provider should also answer your queries in a prompt manner.  Ques : How can I reduce the EMI payable for a personal loan? Ans : You can reduce the EMI for a personal loan by improving/maintaining a credit score over 750. If you have a good relationship with the bank, you can negotiate for a better interest rate or a relationship discount.  Ques : Is pre-payment allowed for personal loans? Ans : Certain lenders may allow you to pre-pay the loan amount, based on their respective terms and conditions. It is likely that you will be charged a pre-payment fee. Thus, if you intend to pre-pay your loan during the loan tenure, make sure to check if your lender allows this.  Ques : Why is it important to have a good credit score? Ans : If you have a good credit score, the chances of you being offered the loan at a low interest rate are quite high. Your credit score indicates your creditworthiness and your repayment ability. If you are looking to apply for a personal loan, it is advisable to maintain a credit score that is over 750. Individuals with a very low credit score may be denied a loan altogether, while those with a moderate credit score may be offered a personal loan, but at a high interest rate.  Ques : How long do lenders take to disburse the loan amount? Ans : If you are a pre-approved customer, the loan amount will be disbursed to your account quickly. If you are applying through offline channels, you will need to submit the required documents and wait for your loan request to be approved, post which you will receive the loan amount. If you apply through third-party financial services websites like BankBazaar.com, your loan amount will be disbursed in a timely manner once your application is approved. As mentioned earlier, it is important to do your research before applying for a personal loan. It is advisable to use a third-party aggregator website like BankBazaar.com to compare loans offered by different banks and financial institutions. You can, thus, check and compare the interest rate charged, processing fee charged, loan amount offered, etc., by different lenders and make a decision accordingly.   Types of Loans and Interest Rates Based on Credit Scores Loan Type Purpose Interest Rate (Excellent: 750+) Interest Rate (Good: 700-749) Interest Rate (Fair: 650-699) Interest Rate (Poor: 600-649) Interest Rate (Very Poor: <600) Personal Loan Debt consolidation, major expenses 7% - 10% 10% - 13% 13% - 17% 17% - 23% 23% - 30% Auto Loan Purchase of a vehicle 3% - 6% 6% - 8% 8% - 12% 12% - 16% 16% - 20% Mortgage Loan Home purchase 2.5% - 4.5% 4.5% - 5.5% 5.5% - 6.5% 6.5% - 8% 8% - 10% Student Loan Education 3% - 5% 5% - 6.5% 6.5% - 8% 8% - 10% 10% - 12% Home Equity Loan Home improvements 4% - 6% 6% - 8% 8% - 10% 10% - 13% 13% - 16% Credit Card Loan Revolving credit for purchases 12% - 15% 15% - 19% 19% - 24% 24% - 28% 28% - 35% Small Business Loan Business expenses, startup costs 5% - 8% 8% - 11% 11% - 14% 14% - 18% 18% - 22%       \n",
            "DEBUG:extract_data_step_6b8b132d-1650-4a34-98d0-e43a3f117e88:Model response: {\"entities\": [{\"label\": \"Loan\", \"attributes\": {\"loan_type\": \"Personal Loan\", \"purpose\": \"Debt consolidation\", \"interest_rate_excellent\": \"7% - 10%\", \"interest_rate_good\": \"10% - 13%\", \"interest_rate_fair\": \"13% - 17%\", \"interest_rate_poor\": \"17% - 23%\", \"interest_rate_very_poor\": \"23% - 30%\"}}, {\"label\": \"Loan\", \"attributes\": {\"loan_type\": \"Auto Loan\", \"purpose\": \"Purchase of a vehicle\", \"interest_rate_excellent\": \"3% - 6%\", \"interest_rate_good\": \"6% - 8%\", \"interest_rate_fair\": \"8% - 12%\", \"interest_rate_poor\": \"12% - 16%\", \"interest_rate_very_poor\": \"16% - 20%\"}}, {\"label\": \"Loan\", \"attributes\": {\"loan_type\": \"Mortgage Loan\", \"purpose\": \"Home purchase\", \"interest_rate_excellent\": \"2.5% - 4.5%\", \"interest_rate_good\": \"4.5% - 5.5%\", \"interest_rate_fair\": \"5.5% - 6.5%\", \"interest_rate_poor\": \"6.5% - 8%\", \"interest_rate_very_poor\": \"8% - 10%\"}}, {\"label\": \"Loan\", \"attributes\": {\"loan_type\": \"Student Loan\", \"purpose\": \"Education\", \"interest_rate_excellent\": \"3% - 5%\", \"interest_rate_good\": \"5% - 6.5%\", \"interest_rate_fair\": \"6.5% - 8%\", \"interest_rate_poor\": \"8% - 10%\", \"interest_rate_very_poor\": \"10% - 12%\"}}, {\"label\": \"Loan\", \"attributes\": {\"loan_type\": \"Home Equity Loan\", \"purpose\": \"Home improvements\", \"interest_rate_excellent\": \"4% - 6%\", \"interest_rate_good\": \"6% - 8%\", \"interest_rate_fair\": \"8% - 10%\", \"interest_rate_poor\": \"10% - 13%\", \"interest_rate_very_poor\": \"13% - 16%\"}}, {\"label\": \"Loan\", \"attributes\": {\"loan_type\": \"Credit Card Loan\", \"purpose\": \"Revolving credit for purchases\", \"interest_rate_excellent\": \"12% - 15%\", \"interest_rate_good\": \"15% - 19%\", \"interest_rate_fair\": \"19% - 24%\", \"interest_rate_poor\": \"24% - 28%\", \"interest_rate_very_poor\": \"28% - 35%\"}}, {\"label\": \"Loan\", \"attributes\": {\"loan_type\": \"Small Business Loan\", \"purpose\": \"Business expenses, startup costs\", \"interest_rate_excellent\": \"5% - 8%\", \"interest_rate_good\": \"8% - 11%\", \"interest_rate_fair\": \"11% - 14%\", \"interest_rate_poor\": \"14% - 18%\", \"interest_rate_very_poor\": \"18% - 22%\"}}, {\"label\": \"Website\", \"attributes\": {\"name\": \"BankBazaar.com\"}}, {\"label\": \"FinancialInstitution\", \"attributes\": {\"name\": null}}], \"relations\": []}\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MERGE (n:Loan {loan_type: \"Personal Loan\"}) SET n += {purpose: \"Debt consolidation\", interest_rate_excellent: \"7% - 10%\", interest_rate_good: \"10% - 13%\", interest_rate_fair: \"13% - 17%\", interest_rate_poor: \"17% - 23%\", interest_rate_very_poor: \"23% - 30%\"}\n",
            "ERROR:extract_data_step_6b8b132d-1650-4a34-98d0-e43a3f117e88:Error creating entity: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MERGE (n:Loan {loan_type: \"Personal Loan\"}) SET n += {purpose: \"Debt consolidation\", interest_rate_excellent: \"7% - 10%\",`, \n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MERGE (n:Loan {loan_type: \"Auto Loan\"}) SET n += {purpose: \"Purchase of a vehicle\", interest_rate_excellent: \"3% - 6%\", interest_rate_good: \"6% - 8%\", interest_rate_fair: \"8% - 12%\", interest_rate_poor: \"12% - 16%\", interest_rate_very_poor: \"16% - 20%\"}\n",
            "ERROR:extract_data_step_6b8b132d-1650-4a34-98d0-e43a3f117e88:Error creating entity: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MERGE (n:Loan {loan_type: \"Auto Loan\"}) SET n += {purpose: \"Purchase of a vehicle\", interest_rate_excellent: \"3% - 6%\", i`, \n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MERGE (n:Loan {loan_type: \"Mortgage Loan\"}) SET n += {purpose: \"Home purchase\", interest_rate_excellent: \"2.5% - 4.5%\", interest_rate_good: \"4.5% - 5.5%\", interest_rate_fair: \"5.5% - 6.5%\", interest_rate_poor: \"6.5% - 8%\", interest_rate_very_poor: \"8% - 10%\"}\n",
            "ERROR:extract_data_step_6b8b132d-1650-4a34-98d0-e43a3f117e88:Error creating entity: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MERGE (n:Loan {loan_type: \"Mortgage Loan\"}) SET n += {purpose: \"Home purchase\", interest_rate_excellent: \"2.5% - 4.5%\", i`, \n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MERGE (n:Loan {loan_type: \"Student Loan\"}) SET n += {purpose: \"Education\", interest_rate_excellent: \"3% - 5%\", interest_rate_good: \"5% - 6.5%\", interest_rate_fair: \"6.5% - 8%\", interest_rate_poor: \"8% - 10%\", interest_rate_very_poor: \"10% - 12%\"}\n",
            "ERROR:extract_data_step_6b8b132d-1650-4a34-98d0-e43a3f117e88:Error creating entity: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MERGE (n:Loan {loan_type: \"Student Loan\"}) SET n += {purpose: \"Education\", interest_rate_excellent: \"3% - 5%\", interest_r`, \n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MERGE (n:Loan {loan_type: \"Home Equity Loan\"}) SET n += {purpose: \"Home improvements\", interest_rate_excellent: \"4% - 6%\", interest_rate_good: \"6% - 8%\", interest_rate_fair: \"8% - 10%\", interest_rate_poor: \"10% - 13%\", interest_rate_very_poor: \"13% - 16%\"}\n",
            "ERROR:extract_data_step_6b8b132d-1650-4a34-98d0-e43a3f117e88:Error creating entity: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MERGE (n:Loan {loan_type: \"Home Equity Loan\"}) SET n += {purpose: \"Home improvements\", interest_rate_excellent: \"4% - 6%\"`, \n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MERGE (n:Loan {loan_type: \"Credit Card Loan\"}) SET n += {purpose: \"Revolving credit for purchases\", interest_rate_excellent: \"12% - 15%\", interest_rate_good: \"15% - 19%\", interest_rate_fair: \"19% - 24%\", interest_rate_poor: \"24% - 28%\", interest_rate_very_poor: \"28% - 35%\"}\n",
            "ERROR:extract_data_step_6b8b132d-1650-4a34-98d0-e43a3f117e88:Error creating entity: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MERGE (n:Loan {loan_type: \"Credit Card Loan\"}) SET n += {purpose: \"Revolving credit for purchases\", interest_rate_excelle`, \n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MERGE (n:Loan {loan_type: \"Small Business Loan\"}) SET n += {purpose: \"Business expenses, startup costs\", interest_rate_excellent: \"5% - 8%\", interest_rate_good: \"8% - 11%\", interest_rate_fair: \"11% - 14%\", interest_rate_poor: \"14% - 18%\", interest_rate_very_poor: \"18% - 22%\"}\n",
            "ERROR:extract_data_step_6b8b132d-1650-4a34-98d0-e43a3f117e88:Error creating entity: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MERGE (n:Loan {loan_type: \"Small Business Loan\"}) SET n += {purpose: \"Business expenses, startup costs\", interest_rate_ex`, \n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MERGE (n:Website {name: \"BankBazaar.com\"}) \n",
            "ERROR:extract_data_step_6b8b132d-1650-4a34-98d0-e43a3f117e88:Error creating entity: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MERGE (n:Website {name: \"BankBazaar.com\"}) `, `--compact`, \n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MERGE (n:FinancialInstitution {name: \"\"}) \n",
            "ERROR:extract_data_step_6b8b132d-1650-4a34-98d0-e43a3f117e88:Error creating entity: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MERGE (n:FinancialInstitution {name: \"\"}) `, `--compact`, \n"
          ]
        }
      ],
      "source": [
        "# After approving the ontology, load it from disk.\n",
        "ontology_file = \"ontology.json\"\n",
        "with open(ontology_file, \"r\", encoding=\"utf-8\") as file:\n",
        "    ontology = Ontology.from_json(json.loads(file.read()))\n",
        "\n",
        "kg = KnowledgeGraph(\n",
        "    name=\"ufc\",\n",
        "    model_config=KnowledgeGraphModelConfig.with_model(model),\n",
        "    ontology=ontology,\n",
        ")\n",
        "kg.process_sources(sources)"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "XR7X1loLjWN_"
      },
      "source": [
        "### Graph RAG\n",
        "\n",
        "At this point, we have a Knowledge Graph based on our data, and we can use it in our GraphRAG system. Utilize the method `chat_session` method for starting a conversation."
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 19,
      "metadata": {
        "id": "-2bFRR2BjWN_",
        "outputId": "1b1cdba2-1801-4475-af8e-20386c3d8a80",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 1000
        }
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Prompt: \n",
            "Using the ontology provided, generate an OpenCypher statement to query the graph database returning all relevant entities, relationships, and attributes to answer the question below:\n",
            "If you cannot generate a OpenCypher statement for any reason, return an empty string.\n",
            "Respect the order of the relationships, the arrows should always point from the \"source\" to the \"target\".\n",
            "\n",
            "Question: What are the loans avialable?\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Statement Response: GenerationResponse(text=```cypher\n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "```\n",
            ", finish_reason=STOP)\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher: \n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Error: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Prompt: \n",
            "The Cypher statement above failed with the following error:\n",
            "\"unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \"\n",
            "\n",
            "Try to generate a new valid OpenCypher statement.\n",
            "Use only the provided entities, relationships types and properties in the ontology.\n",
            "The output must be only a valid OpenCypher statement.\n",
            "Do not include any apologies or other texts, except the generated OpenCypher statement, enclosed in triple backticks.\n",
            "\n",
            "Question: What are the loans avialable?\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Statement Response: GenerationResponse(text=```cypher\n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "```\n",
            ", finish_reason=STOP)\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher: \n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Error: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Prompt: \n",
            "The Cypher statement above failed with the following error:\n",
            "\"unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \"\n",
            "\n",
            "Try to generate a new valid OpenCypher statement.\n",
            "Use only the provided entities, relationships types and properties in the ontology.\n",
            "The output must be only a valid OpenCypher statement.\n",
            "Do not include any apologies or other texts, except the generated OpenCypher statement, enclosed in triple backticks.\n",
            "\n",
            "Question: What are the loans avialable?\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Statement Response: GenerationResponse(text=```cypher\n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "```\n",
            ", finish_reason=STOP)\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher: \n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Error: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Prompt: \n",
            "The Cypher statement above failed with the following error:\n",
            "\"unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \"\n",
            "\n",
            "Try to generate a new valid OpenCypher statement.\n",
            "Use only the provided entities, relationships types and properties in the ontology.\n",
            "The output must be only a valid OpenCypher statement.\n",
            "Do not include any apologies or other texts, except the generated OpenCypher statement, enclosed in triple backticks.\n",
            "\n",
            "Question: What are the loans avialable?\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Statement Response: GenerationResponse(text=```cypher\n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "```\n",
            ", finish_reason=STOP)\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher: \n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Error: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Prompt: \n",
            "The Cypher statement above failed with the following error:\n",
            "\"unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \"\n",
            "\n",
            "Try to generate a new valid OpenCypher statement.\n",
            "Use only the provided entities, relationships types and properties in the ontology.\n",
            "The output must be only a valid OpenCypher statement.\n",
            "Do not include any apologies or other texts, except the generated OpenCypher statement, enclosed in triple backticks.\n",
            "\n",
            "Question: What are the loans avialable?\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Statement Response: GenerationResponse(text=```cypher\n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "```\n",
            ", finish_reason=STOP)\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher: \n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Error: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \n"
          ]
        },
        {
          "output_type": "error",
          "ename": "Exception",
          "evalue": "Failed to generate Cypher query: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, ",
          "traceback": [
            "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
            "\u001b[0;31mException\u001b[0m                                 Traceback (most recent call last)",
            "\u001b[0;32m<ipython-input-19-20fb5fab0d5e>\u001b[0m in \u001b[0;36m<cell line: 3>\u001b[0;34m()\u001b[0m\n\u001b[1;32m      1\u001b[0m \u001b[0;31m# Conversation.\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      2\u001b[0m \u001b[0mchat\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mkg\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mchat_session\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 3\u001b[0;31m \u001b[0mresponse\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mchat\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msend_message\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"What are the loans avialable?\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      4\u001b[0m \u001b[0;31m# print(response)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      5\u001b[0m \u001b[0;31m# response = chat.send_message(\"Tell me about one of his fights?\")\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/local/lib/python3.10/dist-packages/graphrag_sdk/chat_session.py\u001b[0m in \u001b[0;36msend_message\u001b[0;34m(self, message)\u001b[0m\n\u001b[1;32m     72\u001b[0m         )\n\u001b[1;32m     73\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 74\u001b[0;31m         \u001b[0;34m(\u001b[0m\u001b[0mcontext\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcypher\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mcypher_step\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmessage\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     75\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     76\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0mcypher\u001b[0m \u001b[0;32mor\u001b[0m \u001b[0mlen\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcypher\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;36m0\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/local/lib/python3.10/dist-packages/graphrag_sdk/steps/graph_query_step.py\u001b[0m in \u001b[0;36mrun\u001b[0;34m(self, question, retries)\u001b[0m\n\u001b[1;32m     85\u001b[0m                 \u001b[0mretries\u001b[0m \u001b[0;34m-=\u001b[0m \u001b[0;36m1\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     86\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 87\u001b[0;31m         \u001b[0;32mraise\u001b[0m \u001b[0mException\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"Failed to generate Cypher query: \"\u001b[0m \u001b[0;34m+\u001b[0m \u001b[0mstr\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0merror\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
            "\u001b[0;31mException\u001b[0m: Failed to generate Cypher query: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, "
          ]
        }
      ],
      "source": [
        "# Conversation.\n",
        "chat = kg.chat_session()\n",
        "response = chat.send_message(\"What are the loans avialable?\")\n",
        "# print(response)\n",
        "# response = chat.send_message(\"Tell me about one of his fights?\")\n",
        "print(response)"
      ]
    },
    {
      "source": [
        "!pip install neo4j"
      ],
      "cell_type": "code",
      "metadata": {
        "id": "UKBylAa3lxcr",
        "outputId": "af825d1e-bf37-4111-cd1e-e426f31b4fc2",
        "colab": {
          "base_uri": "https://localhost:8080/"
        }
      },
      "execution_count": 20,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Collecting neo4j\n",
            "  Downloading neo4j-5.25.0-py3-none-any.whl.metadata (5.7 kB)\n",
            "Requirement already satisfied: pytz in /usr/local/lib/python3.10/dist-packages (from neo4j) (2024.2)\n",
            "Downloading neo4j-5.25.0-py3-none-any.whl (296 kB)\n",
            "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m296.6/296.6 kB\u001b[0m \u001b[31m4.1 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25hInstalling collected packages: neo4j\n",
            "Successfully installed neo4j-5.25.0\n"
          ]
        }
      ]
    },
    {
      "source": [
        "from neo4j import GraphDatabase\n",
        "from graphrag_sdk import KnowledgeGraph, KnowledgeGraphModelConfig, Ontology\n",
        "\n",
        "# ... (your existing code to load the ontology and model) ...\n",
        "\n",
        "# Initialize the Neo4j driver\n",
        "driver = GraphDatabase.driver(\"neo4j+s://acc0740c.databases.neo4j.io\", auth=(\"neo4j\", \"EqXiTPsdJGYo7cBu6PY66dQ380P5mQoQgcaY3Bub7a0\")) # Replace with your Neo4j credentials\n",
        "\n",
        "kg = KnowledgeGraph(\n",
        "    name=\"ufc\",\n",
        "    model_config=KnowledgeGraphModelConfig.with_model(model),\n",
        "    ontology=ontology,\n",
        "    # driver=driver # Pass the driver to the KnowledgeGraph\n",
        ")\n",
        "\n",
        "# with driver.session() as session:\n",
        "#     session.run(\"CREATE (n:Person {name: 'Alice'})\")\n",
        "\n",
        "kg.process_sources(sources)\n"
      ],
      "cell_type": "code",
      "metadata": {
        "id": "9DkwIEX_lyTx",
        "outputId": "4409e46c-1d66-43c9-d2f6-707452b29189",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 716
        }
      },
      "execution_count": 24,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "DEBUG:graphrag_sdk.steps.extract_data_step:Processing 1 documents\n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Processing task: extract_data_step_74b026a6-3b09-4417-8725-426ac7376d67\n",
            "DEBUG:extract_data_step_74b026a6-3b09-4417-8725-426ac7376d67:Processing task: extract_data_step_74b026a6-3b09-4417-8725-426ac7376d67\n",
            "DEBUG:extract_data_step_74b026a6-3b09-4417-8725-426ac7376d67:User message:  You are tasked with extracting entities and relations from the text below, using the ontology provided.  **Output Format:**  - Provide the extracted data as a JSON object with two keys: `\"entities\"` and `\"relations\"`.  - **Entities**: Represent entities and concepts. Each entity should have a `\"label\"` and `\"attributes\"` field.  - **Relations**: Represent relations between entities or concepts. Each relation should have a `\"label\"`, `\"source\"`, `\"target\"`, and `\"attributes\"` field.  **Guidelines:** - **Extract all entities and relations**: Capture all entities and relations mentioned in the text.  - **Use Only the Provided Ontology**: Utilize only the types of entities, relations, and attributes defined in the ontology.  - **Assign IDs Where Required**: Assign textual IDs to entities and relations as specified.  - **Avoid Duplicates**: Ensure each entity and relation is unique; do not include duplicates.  - **Formatting**:   - Do not include any introduction or explanation in the response, only the JSON.      - Use double quotes for all string values.    - Properly escape any special characters.    - Dates should be in the format `\"YYYY-MM-DD\"`.    - Correct any spacing or formatting issues in text fields as necessary.  - **Precision**: Be concise and precise in your extraction.  - **Token Limit**: Ensure your response does not exceed **8192 tokens**.  **User Instructions**:    **Ontology**: {'entities': [{'label': 'Loan', 'attributes': [{'name': 'loan_type', 'type': 'string', 'unique': True, 'required': True}, {'name': 'purpose', 'type': 'string', 'unique': False, 'required': True}, {'name': 'interest_rate_excellent', 'type': 'string', 'unique': False, 'required': False}, {'name': 'interest_rate_good', 'type': 'string', 'unique': False, 'required': False}, {'name': 'interest_rate_fair', 'type': 'string', 'unique': False, 'required': False}, {'name': 'interest_rate_poor', 'type': 'string', 'unique': False, 'required': False}, {'name': 'interest_rate_very_poor', 'type': 'string', 'unique': False, 'required': False}], 'description': ''}, {'label': 'Website', 'attributes': [{'name': 'name', 'type': 'string', 'unique': True, 'required': True}], 'description': ''}, {'label': 'FinancialInstitution', 'attributes': [{'name': 'name', 'type': 'string', 'unique': True, 'required': False}], 'description': ''}], 'relations': [{'label': 'PROVIDES', 'source': {'label': 'FinancialInstitution'}, 'target': {'label': 'Loan'}, 'attributes': []}, {'label': 'HAS', 'source': {'label': 'FinancialInstitution'}, 'target': {'label': 'Website'}, 'attributes': []}, {'label': 'CALCULATES', 'source': {'label': 'Website'}, 'target': {'label': 'Loan'}, 'attributes': [{'name': 'eligibility', 'type': 'boolean', 'unique': False, 'required': True}]}]}  **Raw Text**: Common Questions for Personal Loans Answered  Ques : How do I check if I am eligible to apply for a personal loan? Ans : Most lenders specify the eligibility criteria that you will need to meet for your loan application to be approved on their respective websites. You can also use the personal loan eligibility calculator tool, which you will find on the websites of banks and financial institutions and on third-party financial services websites like BankBazaar.com.  Ques : What is the maximum sum of money that I can borrow from a bank? Ans : The maximum sum of money that you will be able to borrow from a bank will vary based on a number of factors. If you are a salaried employee, your monthly EMI should ideally not exceed 30% of your monthly pay. Also, the bank/NBFC will take into account if you have any existing loans for which you pay EMIs. Individuals who are self-employed will be offered a loan amount as per the profits that are earned through their business. The concerned individual's other financial liabilities will also be taken into account. The maximum loan amount offered will also depend on the lender's own terms and conditions.  Ques : Are there any advantages in applying for a personal loan online? Ans : Yes, applying for a personal loan online saves you a considerable amount of time and effort, given that you can do it from the comfort of your house. Certain third-party financial services websites like BankBazaar.com also offer paperless approval, wherein you will not be required to submit any paperwork to the lender for your loan to be approved. The application process is also completely secure.  Ques : What is the repayment tenure for personal loans? Ans : Most banks/financial institutions allow borrowers to choose a loan tenure between 1 year and 5 years, based on their convenience.  Ques : What documents will I have to submit when applying for a personal loan? Ans : While the exact documents required vary from lender to lender, listed below are a few general documents that most banks/financial institutions usually require applicants to submit: * Proof of identity * Address proof * Proof of income * Proof of business (applicable only for self-employed individuals) * Any other documents requested by the lender  Ques : What are the things that I should look for before applying for a personal loan? Ans : A few things that you should consider when applying for a personal loan are as follows: * Interest Rates: The interest rate charged for a personal loan can go from as low as 10% p.a. to as high as 24% p.a., based on the lender's terms and conditions and your credit score. The interest rate makes a substantial difference to the cumulative cost of the loan. * Repayment Flexibility: Make sure to check if the lender allows part-payments or pre-payments and if there is any penalty levied for making the payment. * Processing Fee: Even if you are offered a low interest rate, a high processing fee could bump up the cost of your loan. * Customer Service: Ensure that the lender has sufficient customer care channels for you to reach them on. Your loan provider should also answer your queries in a prompt manner.  Ques : How can I reduce the EMI payable for a personal loan? Ans : You can reduce the EMI for a personal loan by improving/maintaining a credit score over 750. If you have a good relationship with the bank, you can negotiate for a better interest rate or a relationship discount.  Ques : Is pre-payment allowed for personal loans? Ans : Certain lenders may allow you to pre-pay the loan amount, based on their respective terms and conditions. It is likely that you will be charged a pre-payment fee. Thus, if you intend to pre-pay your loan during the loan tenure, make sure to check if your lender allows this.  Ques : Why is it important to have a good credit score? Ans : If you have a good credit score, the chances of you being offered the loan at a low interest rate are quite high. Your credit score indicates your creditworthiness and your repayment ability. If you are looking to apply for a personal loan, it is advisable to maintain a credit score that is over 750. Individuals with a very low credit score may be denied a loan altogether, while those with a moderate credit score may be offered a personal loan, but at a high interest rate.  Ques : How long do lenders take to disburse the loan amount? Ans : If you are a pre-approved customer, the loan amount will be disbursed to your account quickly. If you are applying through offline channels, you will need to submit the required documents and wait for your loan request to be approved, post which you will receive the loan amount. If you apply through third-party financial services websites like BankBazaar.com, your loan amount will be disbursed in a timely manner once your application is approved. As mentioned earlier, it is important to do your research before applying for a personal loan. It is advisable to use a third-party aggregator website like BankBazaar.com to compare loans offered by different banks and financial institutions. You can, thus, check and compare the interest rate charged, processing fee charged, loan amount offered, etc., by different lenders and make a decision accordingly.   Types of Loans and Interest Rates Based on Credit Scores Loan Type Purpose Interest Rate (Excellent: 750+) Interest Rate (Good: 700-749) Interest Rate (Fair: 650-699) Interest Rate (Poor: 600-649) Interest Rate (Very Poor: <600) Personal Loan Debt consolidation, major expenses 7% - 10% 10% - 13% 13% - 17% 17% - 23% 23% - 30% Auto Loan Purchase of a vehicle 3% - 6% 6% - 8% 8% - 12% 12% - 16% 16% - 20% Mortgage Loan Home purchase 2.5% - 4.5% 4.5% - 5.5% 5.5% - 6.5% 6.5% - 8% 8% - 10% Student Loan Education 3% - 5% 5% - 6.5% 6.5% - 8% 8% - 10% 10% - 12% Home Equity Loan Home improvements 4% - 6% 6% - 8% 8% - 10% 10% - 13% 13% - 16% Credit Card Loan Revolving credit for purchases 12% - 15% 15% - 19% 19% - 24% 24% - 28% 28% - 35% Small Business Loan Business expenses, startup costs 5% - 8% 8% - 11% 11% - 14% 14% - 18% 18% - 22%       \n",
            "DEBUG:extract_data_step_74b026a6-3b09-4417-8725-426ac7376d67:Model response: {\"entities\": [{\"label\": \"Loan\", \"attributes\": {\"loan_type\": \"Personal Loan\", \"purpose\": \"Debt consolidation\"}}, {\"label\": \"Loan\", \"attributes\": {\"loan_type\": \"Personal Loan\", \"purpose\": \"major expenses\"}}, {\"label\": \"Loan\", \"attributes\": {\"loan_type\": \"Auto Loan\", \"purpose\": \"Purchase of a vehicle\"}}, {\"label\": \"Loan\", \"attributes\": {\"loan_type\": \"Mortgage Loan\", \"purpose\": \"Home purchase\"}}, {\"label\": \"Loan\", \"attributes\": {\"loan_type\": \"Student Loan\", \"purpose\": \"Education\"}}, {\"label\": \"Loan\", \"attributes\": {\"loan_type\": \"Home Equity Loan\", \"purpose\": \"Home improvements\"}}, {\"label\": \"Loan\", \"attributes\": {\"loan_type\": \"Credit Card Loan\", \"purpose\": \"Revolving credit for purchases\"}}, {\"label\": \"Loan\", \"attributes\": {\"loan_type\": \"Small Business Loan\", \"purpose\": \"Business expenses\"}}, {\"label\": \"Loan\", \"attributes\": {\"loan_type\": \"Small Business Loan\", \"purpose\": \"startup costs\"}}, {\"label\": \"Website\", \"attributes\": {\"name\": \"BankBazaar.com\"}}, {\"label\": \"FinancialInstitution\", \"attributes\": {}}], \"relations\": [{\"label\": \"PROVIDES\", \"source\": {\"label\": \"FinancialInstitution\", \"attributes\": {}}, \"target\": {\"label\": \"Loan\", \"attributes\": {\"loan_type\": \"Personal Loan\", \"purpose\": \"Debt consolidation\"}}}, {\"label\": \"PROVIDES\", \"source\": {\"label\": \"FinancialInstitution\", \"attributes\": {}}, \"target\": {\"label\": \"Loan\", \"attributes\": {\"loan_type\": \"Personal Loan\", \"purpose\": \"major expenses\"}}}, {\"label\": \"CALCULATES\", \"source\": {\"label\": \"Website\", \"attributes\": {\"name\": \"BankBazaar.com\"}}, \"target\": {\"label\": \"Loan\", \"attributes\": {\"loan_type\": \"Personal Loan\", \"purpose\": \"Debt consolidation\"}}, \"attributes\": {\"eligibility\": true}}, {\"label\": \"CALCULATES\", \"source\": {\"label\": \"Website\", \"attributes\": {\"name\": \"BankBazaar.com\"}}, \"target\": {\"label\": \"Loan\", \"attributes\": {\"loan_type\": \"Personal Loan\", \"purpose\": \"major expenses\"}}, \"attributes\": {\"eligibility\": true}}, {\"label\": \"HAS\", \"source\": {\"label\": \"FinancialInstitution\", \"attributes\": {}}, \"target\": {\"label\": \"Website\", \"attributes\": {\"name\": \"BankBazaar.com\"}}}]}\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MERGE (n:Loan {loan_type: \"Personal Loan\"}) SET n += {purpose: \"Debt consolidation\"}\n",
            "ERROR:extract_data_step_74b026a6-3b09-4417-8725-426ac7376d67:Error creating entity: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MERGE (n:Loan {loan_type: \"Personal Loan\"}) SET n += {purpose: \"Debt consolidation\"}`, `--compact`, \n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MERGE (n:Loan {loan_type: \"Personal Loan\"}) SET n += {purpose: \"major expenses\"}\n",
            "ERROR:extract_data_step_74b026a6-3b09-4417-8725-426ac7376d67:Error creating entity: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MERGE (n:Loan {loan_type: \"Personal Loan\"}) SET n += {purpose: \"major expenses\"}`, `--compact`, \n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MERGE (n:Loan {loan_type: \"Auto Loan\"}) SET n += {purpose: \"Purchase of a vehicle\"}\n",
            "ERROR:extract_data_step_74b026a6-3b09-4417-8725-426ac7376d67:Error creating entity: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MERGE (n:Loan {loan_type: \"Auto Loan\"}) SET n += {purpose: \"Purchase of a vehicle\"}`, `--compact`, \n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MERGE (n:Loan {loan_type: \"Mortgage Loan\"}) SET n += {purpose: \"Home purchase\"}\n",
            "ERROR:extract_data_step_74b026a6-3b09-4417-8725-426ac7376d67:Error creating entity: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MERGE (n:Loan {loan_type: \"Mortgage Loan\"}) SET n += {purpose: \"Home purchase\"}`, `--compact`, \n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MERGE (n:Loan {loan_type: \"Student Loan\"}) SET n += {purpose: \"Education\"}\n",
            "ERROR:extract_data_step_74b026a6-3b09-4417-8725-426ac7376d67:Error creating entity: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MERGE (n:Loan {loan_type: \"Student Loan\"}) SET n += {purpose: \"Education\"}`, `--compact`, \n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MERGE (n:Loan {loan_type: \"Home Equity Loan\"}) SET n += {purpose: \"Home improvements\"}\n",
            "ERROR:extract_data_step_74b026a6-3b09-4417-8725-426ac7376d67:Error creating entity: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MERGE (n:Loan {loan_type: \"Home Equity Loan\"}) SET n += {purpose: \"Home improvements\"}`, `--compact`, \n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MERGE (n:Loan {loan_type: \"Credit Card Loan\"}) SET n += {purpose: \"Revolving credit for purchases\"}\n",
            "ERROR:extract_data_step_74b026a6-3b09-4417-8725-426ac7376d67:Error creating entity: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MERGE (n:Loan {loan_type: \"Credit Card Loan\"}) SET n += {purpose: \"Revolving credit for purchases\"}`, `--compact`, \n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MERGE (n:Loan {loan_type: \"Small Business Loan\"}) SET n += {purpose: \"Business expenses\"}\n",
            "ERROR:extract_data_step_74b026a6-3b09-4417-8725-426ac7376d67:Error creating entity: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MERGE (n:Loan {loan_type: \"Small Business Loan\"}) SET n += {purpose: \"Business expenses\"}`, `--compact`, \n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MERGE (n:Loan {loan_type: \"Small Business Loan\"}) SET n += {purpose: \"startup costs\"}\n",
            "ERROR:extract_data_step_74b026a6-3b09-4417-8725-426ac7376d67:Error creating entity: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MERGE (n:Loan {loan_type: \"Small Business Loan\"}) SET n += {purpose: \"startup costs\"}`, `--compact`, \n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MERGE (n:Website {name: \"BankBazaar.com\"}) \n",
            "ERROR:extract_data_step_74b026a6-3b09-4417-8725-426ac7376d67:Error creating entity: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MERGE (n:Website {name: \"BankBazaar.com\"}) `, `--compact`, \n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MERGE (n:FinancialInstitution {name: \"\"}) \n",
            "ERROR:extract_data_step_74b026a6-3b09-4417-8725-426ac7376d67:Error creating entity: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MERGE (n:FinancialInstitution {name: \"\"}) `, `--compact`, \n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MATCH (s:FinancialInstitution {}) MATCH (d:Loan {loan_type: \"Personal Loan\", purpose: \"Debt consolidation\"}) MERGE (s)-[r:PROVIDES]->(d) \n",
            "ERROR:extract_data_step_74b026a6-3b09-4417-8725-426ac7376d67:Error creating relation: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MATCH (s:FinancialInstitution {}) MATCH (d:Loan {loan_type: \"Personal Loan\", purpose: \"Debt consolidation\"}) MERGE (s)-[r`, \n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MATCH (s:FinancialInstitution {}) MATCH (d:Loan {loan_type: \"Personal Loan\", purpose: \"major expenses\"}) MERGE (s)-[r:PROVIDES]->(d) \n",
            "ERROR:extract_data_step_74b026a6-3b09-4417-8725-426ac7376d67:Error creating relation: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MATCH (s:FinancialInstitution {}) MATCH (d:Loan {loan_type: \"Personal Loan\", purpose: \"major expenses\"}) MERGE (s)-[r:PRO`, \n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MATCH (s:Website {name: \"BankBazaar.com\"}) MATCH (d:Loan {loan_type: \"Personal Loan\", purpose: \"Debt consolidation\"}) MERGE (s)-[r:CALCULATES]->(d) SET r += {eligibility: True}\n",
            "ERROR:extract_data_step_74b026a6-3b09-4417-8725-426ac7376d67:Error creating relation: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MATCH (s:Website {name: \"BankBazaar.com\"}) MATCH (d:Loan {loan_type: \"Personal Loan\", purpose: \"Debt consolidation\"}) MER`, \n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MATCH (s:Website {name: \"BankBazaar.com\"}) MATCH (d:Loan {loan_type: \"Personal Loan\", purpose: \"major expenses\"}) MERGE (s)-[r:CALCULATES]->(d) SET r += {eligibility: True}\n",
            "ERROR:extract_data_step_74b026a6-3b09-4417-8725-426ac7376d67:Error creating relation: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MATCH (s:Website {name: \"BankBazaar.com\"}) MATCH (d:Loan {loan_type: \"Personal Loan\", purpose: \"major expenses\"}) MERGE (`, \n",
            "DEBUG:graphrag_sdk.steps.extract_data_step:Query: MATCH (s:FinancialInstitution {}) MATCH (d:Website {name: \"BankBazaar.com\"}) MERGE (s)-[r:HAS]->(d) \n",
            "ERROR:extract_data_step_74b026a6-3b09-4417-8725-426ac7376d67:Error creating relation: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, `MATCH (s:FinancialInstitution {}) MATCH (d:Website {name: \"BankBazaar.com\"}) MERGE (s)-[r:HAS]->(d) `, `--compact`, \n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "chat = kg.chat_session()\n",
        "response = chat.send_message(\"What are the loans avialable?\")"
      ],
      "metadata": {
        "id": "wsuN7In9pKKi",
        "outputId": "d200d59d-b60f-4975-ad72-9a3422bd0aec",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 1000
        }
      },
      "execution_count": 28,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Prompt: \n",
            "Using the ontology provided, generate an OpenCypher statement to query the graph database returning all relevant entities, relationships, and attributes to answer the question below:\n",
            "If you cannot generate a OpenCypher statement for any reason, return an empty string.\n",
            "Respect the order of the relationships, the arrows should always point from the \"source\" to the \"target\".\n",
            "\n",
            "Question: What are the loans avialable?\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Statement Response: GenerationResponse(text=```cypher\n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "```\n",
            ", finish_reason=STOP)\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher: \n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Error: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Prompt: \n",
            "The Cypher statement above failed with the following error:\n",
            "\"unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \"\n",
            "\n",
            "Try to generate a new valid OpenCypher statement.\n",
            "Use only the provided entities, relationships types and properties in the ontology.\n",
            "The output must be only a valid OpenCypher statement.\n",
            "Do not include any apologies or other texts, except the generated OpenCypher statement, enclosed in triple backticks.\n",
            "\n",
            "Question: What are the loans avialable?\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Statement Response: GenerationResponse(text=```cypher\n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "```\n",
            ", finish_reason=STOP)\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher: \n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Error: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Prompt: \n",
            "The Cypher statement above failed with the following error:\n",
            "\"unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \"\n",
            "\n",
            "Try to generate a new valid OpenCypher statement.\n",
            "Use only the provided entities, relationships types and properties in the ontology.\n",
            "The output must be only a valid OpenCypher statement.\n",
            "Do not include any apologies or other texts, except the generated OpenCypher statement, enclosed in triple backticks.\n",
            "\n",
            "Question: What are the loans avialable?\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Statement Response: GenerationResponse(text=```cypher\n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "```\n",
            ", finish_reason=STOP)\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher: \n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Error: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Prompt: \n",
            "The Cypher statement above failed with the following error:\n",
            "\"unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \"\n",
            "\n",
            "Try to generate a new valid OpenCypher statement.\n",
            "Use only the provided entities, relationships types and properties in the ontology.\n",
            "The output must be only a valid OpenCypher statement.\n",
            "Do not include any apologies or other texts, except the generated OpenCypher statement, enclosed in triple backticks.\n",
            "\n",
            "Question: What are the loans avialable?\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Statement Response: GenerationResponse(text=```cypher\n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "```\n",
            ", finish_reason=STOP)\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher: \n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Error: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Prompt: \n",
            "The Cypher statement above failed with the following error:\n",
            "\"unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \"\n",
            "\n",
            "Try to generate a new valid OpenCypher statement.\n",
            "Use only the provided entities, relationships types and properties in the ontology.\n",
            "The output must be only a valid OpenCypher statement.\n",
            "Do not include any apologies or other texts, except the generated OpenCypher statement, enclosed in triple backticks.\n",
            "\n",
            "Question: What are the loans avialable?\n",
            "\n",
            "WARNING:tornado.access:429 POST /v1beta/models/gemini-1.5-pro-latest:generateContent?%24alt=json%3Benum-encoding%3Dint (127.0.0.1) 1367.25ms\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Error: 429 POST https://generativelanguage.googleapis.com/v1beta/models/gemini-1.5-pro-latest:generateContent?%24alt=json%3Benum-encoding%3Dint: Resource has been exhausted (e.g. check quota).\n"
          ]
        },
        {
          "output_type": "error",
          "ename": "Exception",
          "evalue": "Failed to generate Cypher query: 429 POST https://generativelanguage.googleapis.com/v1beta/models/gemini-1.5-pro-latest:generateContent?%24alt=json%3Benum-encoding%3Dint: Resource has been exhausted (e.g. check quota).",
          "traceback": [
            "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
            "\u001b[0;31mException\u001b[0m                                 Traceback (most recent call last)",
            "\u001b[0;32m<ipython-input-28-b81e31cb4111>\u001b[0m in \u001b[0;36m<cell line: 2>\u001b[0;34m()\u001b[0m\n\u001b[1;32m      1\u001b[0m \u001b[0mchat\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mkg\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mchat_session\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 2\u001b[0;31m \u001b[0mresponse\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mchat\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msend_message\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"What are the loans avialable?\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
            "\u001b[0;32m/usr/local/lib/python3.10/dist-packages/graphrag_sdk/chat_session.py\u001b[0m in \u001b[0;36msend_message\u001b[0;34m(self, message)\u001b[0m\n\u001b[1;32m     72\u001b[0m         )\n\u001b[1;32m     73\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 74\u001b[0;31m         \u001b[0;34m(\u001b[0m\u001b[0mcontext\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcypher\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mcypher_step\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmessage\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     75\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     76\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0mcypher\u001b[0m \u001b[0;32mor\u001b[0m \u001b[0mlen\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcypher\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;36m0\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/local/lib/python3.10/dist-packages/graphrag_sdk/steps/graph_query_step.py\u001b[0m in \u001b[0;36mrun\u001b[0;34m(self, question, retries)\u001b[0m\n\u001b[1;32m     85\u001b[0m                 \u001b[0mretries\u001b[0m \u001b[0;34m-=\u001b[0m \u001b[0;36m1\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     86\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 87\u001b[0;31m         \u001b[0;32mraise\u001b[0m \u001b[0mException\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"Failed to generate Cypher query: \"\u001b[0m \u001b[0;34m+\u001b[0m \u001b[0mstr\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0merror\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
            "\u001b[0;31mException\u001b[0m: Failed to generate Cypher query: 429 POST https://generativelanguage.googleapis.com/v1beta/models/gemini-1.5-pro-latest:generateContent?%24alt=json%3Benum-encoding%3Dint: Resource has been exhausted (e.g. check quota)."
          ]
        }
      ]
    },
    {
      "source": [
        "import functools\n",
        "\n",
        "@functools.lru_cache(maxsize=128)  # Cache up to 128 responses\n",
        "def send_message_with_cache(message):\n",
        "    return chat.send_message(message)\n",
        "\n",
        "# Example usage\n",
        "response = send_message_with_cache(\"What are the loans avialable?\")\n",
        "print(response)"
      ],
      "cell_type": "code",
      "metadata": {
        "id": "0H8pDopyqSQM",
        "outputId": "7ff0daab-5dd7-4fa4-e391-49a6faa22ccc",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 1000
        }
      },
      "execution_count": 31,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Prompt: \n",
            "Using the ontology provided, generate an OpenCypher statement to query the graph database returning all relevant entities, relationships, and attributes to answer the question below:\n",
            "If you cannot generate a OpenCypher statement for any reason, return an empty string.\n",
            "Respect the order of the relationships, the arrows should always point from the \"source\" to the \"target\".\n",
            "\n",
            "Question: What are the loans avialable?\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Statement Response: GenerationResponse(text=```cypher\n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "```\n",
            ", finish_reason=STOP)\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher: \n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Error: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Prompt: \n",
            "The Cypher statement above failed with the following error:\n",
            "\"unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \"\n",
            "\n",
            "Try to generate a new valid OpenCypher statement.\n",
            "Use only the provided entities, relationships types and properties in the ontology.\n",
            "The output must be only a valid OpenCypher statement.\n",
            "Do not include any apologies or other texts, except the generated OpenCypher statement, enclosed in triple backticks.\n",
            "\n",
            "Question: What are the loans avialable?\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Statement Response: GenerationResponse(text=```cypher\n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "```\n",
            ", finish_reason=STOP)\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher: \n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Error: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Prompt: \n",
            "The Cypher statement above failed with the following error:\n",
            "\"unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \"\n",
            "\n",
            "Try to generate a new valid OpenCypher statement.\n",
            "Use only the provided entities, relationships types and properties in the ontology.\n",
            "The output must be only a valid OpenCypher statement.\n",
            "Do not include any apologies or other texts, except the generated OpenCypher statement, enclosed in triple backticks.\n",
            "\n",
            "Question: What are the loans avialable?\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Statement Response: GenerationResponse(text=```cypher\n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "```\n",
            ", finish_reason=STOP)\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher: \n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Error: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Prompt: \n",
            "The Cypher statement above failed with the following error:\n",
            "\"unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \"\n",
            "\n",
            "Try to generate a new valid OpenCypher statement.\n",
            "Use only the provided entities, relationships types and properties in the ontology.\n",
            "The output must be only a valid OpenCypher statement.\n",
            "Do not include any apologies or other texts, except the generated OpenCypher statement, enclosed in triple backticks.\n",
            "\n",
            "Question: What are the loans avialable?\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Statement Response: GenerationResponse(text=```cypher\n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "```\n",
            ", finish_reason=STOP)\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher: \n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Error: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Prompt: \n",
            "The Cypher statement above failed with the following error:\n",
            "\"unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \"\n",
            "\n",
            "Try to generate a new valid OpenCypher statement.\n",
            "Use only the provided entities, relationships types and properties in the ontology.\n",
            "The output must be only a valid OpenCypher statement.\n",
            "Do not include any apologies or other texts, except the generated OpenCypher statement, enclosed in triple backticks.\n",
            "\n",
            "Question: What are the loans avialable?\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher Statement Response: GenerationResponse(text=```cypher\n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "```\n",
            "\n",
            "\n",
            ", finish_reason=STOP)\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Cypher: \n",
            "MATCH (l:Loan)\n",
            "RETURN l\n",
            "\n",
            "DEBUG:graphrag_sdk.steps.graph_query_step:Error: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, \n"
          ]
        },
        {
          "output_type": "error",
          "ename": "Exception",
          "evalue": "Failed to generate Cypher query: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, ",
          "traceback": [
            "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
            "\u001b[0;31mException\u001b[0m                                 Traceback (most recent call last)",
            "\u001b[0;32m<ipython-input-31-18405f326934>\u001b[0m in \u001b[0;36m<cell line: 8>\u001b[0;34m()\u001b[0m\n\u001b[1;32m      6\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      7\u001b[0m \u001b[0;31m# Example usage\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 8\u001b[0;31m \u001b[0mresponse\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0msend_message_with_cache\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"What are the loans avialable?\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      9\u001b[0m \u001b[0mprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mresponse\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m<ipython-input-31-18405f326934>\u001b[0m in \u001b[0;36msend_message_with_cache\u001b[0;34m(message)\u001b[0m\n\u001b[1;32m      3\u001b[0m \u001b[0;34m@\u001b[0m\u001b[0mfunctools\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mlru_cache\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmaxsize\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;36m128\u001b[0m\u001b[0;34m)\u001b[0m  \u001b[0;31m# Cache up to 128 responses\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      4\u001b[0m \u001b[0;32mdef\u001b[0m \u001b[0msend_message_with_cache\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmessage\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 5\u001b[0;31m     \u001b[0;32mreturn\u001b[0m \u001b[0mchat\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msend_message\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmessage\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      6\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      7\u001b[0m \u001b[0;31m# Example usage\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/local/lib/python3.10/dist-packages/graphrag_sdk/chat_session.py\u001b[0m in \u001b[0;36msend_message\u001b[0;34m(self, message)\u001b[0m\n\u001b[1;32m     72\u001b[0m         )\n\u001b[1;32m     73\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 74\u001b[0;31m         \u001b[0;34m(\u001b[0m\u001b[0mcontext\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcypher\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mcypher_step\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmessage\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     75\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     76\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0mcypher\u001b[0m \u001b[0;32mor\u001b[0m \u001b[0mlen\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcypher\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;36m0\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
            "\u001b[0;32m/usr/local/lib/python3.10/dist-packages/graphrag_sdk/steps/graph_query_step.py\u001b[0m in \u001b[0;36mrun\u001b[0;34m(self, question, retries)\u001b[0m\n\u001b[1;32m     85\u001b[0m                 \u001b[0mretries\u001b[0m \u001b[0;34m-=\u001b[0m \u001b[0;36m1\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     86\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 87\u001b[0;31m         \u001b[0;32mraise\u001b[0m \u001b[0mException\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"Failed to generate Cypher query: \"\u001b[0m \u001b[0;34m+\u001b[0m \u001b[0mstr\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0merror\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
            "\u001b[0;31mException\u001b[0m: Failed to generate Cypher query: unknown command `GRAPH.QUERY`, with args beginning with: `ufc`, ` MATCH (l:Loan) RETURN l `, `--compact`, "
          ]
        }
      ]
    }
  ],
  "metadata": {
    "kernelspec": {
      "display_name": "graphrag-sdk-ceBr3E7y-py3.12",
      "language": "python",
      "name": "python3"
    },
    "language_info": {
      "codemirror_mode": {
        "name": "ipython",
        "version": 3
      },
      "file_extension": ".py",
      "mimetype": "text/x-python",
      "name": "python",
      "nbconvert_exporter": "python",
      "pygments_lexer": "ipython3",
      "version": "3.12.3"
    },
    "colab": {
      "provenance": []
    }
  },
  "nbformat": 4,
  "nbformat_minor": 0
}